Revit 2027 API
TransactionAttribute Constructor
Constructs a new TransactionAttribute.
Namespace: Autodesk.Revit.Attributes
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public TransactionAttribute(
	TransactionMode mode
)
Public Sub New (
	mode As TransactionMode
)
public:
TransactionAttribute(
	TransactionMode mode
)
new :
        mode : TransactionMode -> TransactionAttribute
Parameters
mode TransactionMode
See Also
Reference
TransactionAttribute Class
Autodesk.Revit.Attributes Namespace